app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`login`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`, `fb_user_id`, `email_hash`) VALUES('quire', '', 'quire@example.com', '2c92428bd53f44576ebf1c8a7d6a31bfdf899144', '7fc912986a0688265204fb569fbf5ade160a13b1', '2009-12-31 16:04:41', '2009-12-31 16:04:41', NULL, NULL, NULL, NULL)

  def link_user_accounts
    if self.current_user.nil?
      #register with fb
      User.create_from_fb_connect(facebook_session.user)
---
INSERT INTO `users` (`login`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`, `fb_user_id`, `email_hash`) VALUES('facebooker_574101921', 'Leon Gersing', '', NULL, NULL, '2009-12-31 19:43:30', '2009-12-31 19:43:30', NULL, NULL, 574101921, NULL)